# -*- coding: utf-8 -*-

translations = {
    'year': {
        0: 'سنة',
        1: 'سنة',
        2: 'سنتين',
        (3, 10): '{count} سنوات',
        'default': '{count} سنة'
    },
    'month': {
        0: 'شهر',
        1: ' شهر',
        2: 'شهرين',
        (3, 10): '{count} أشهر',
        'default': '{count} شهر'
    },
    'week': {
        0: 'إسبوع',
        1: 'إسبوع',
        2: 'إسبوعين',
        (3, 10): '{count} أسابيع',
        'default': '{count} إسبوع'
    },
    'day': {
        0: 'يوم',
        1: 'يوم',
        2: 'يومين',
        (3, 10): '{count} أيام',
        'default': ' يوم'
    },
    'hour': {
        0: 'ساعة',
        1: 'ساعة',
        2: 'ساعتين',
        (3, 10): '{count} ساعات',
        'default': '{count} ساعة'
    },
    'minute': {
        0: 'دقيقة',
        1: 'دقيقة',
        2: 'دقيقتين',
        (3, 10): '{count} دقائق',
        'default': '{count} دقيقة'
    },
    'second': {
        0: 'ثانية',
        1: 'ثانية',
        2: 'ثانيتين',
        (3, 10): '{count} ثوان',
        'default': '{count} ثانية'
    },
    'ago': 'منذ {time}',
    'from_now': 'من الآن {time}',
    'after': 'بعد {time}',
    'before': 'قبل {time}',
}
