# -*- coding: utf-8 -*-

translations = {
    # Days
    'days': {
        0: 'Κυριακή',
        1: 'Δευτέρα',
        2: 'Τρίτη',
        3: 'Τετάρτη',
        4: 'Πέμπτη',
        5: 'Παρασκευή',
        6: 'Σάββατο'
    },
    'days_abbrev': {
        0: 'Κυρ',
        1: 'Δευ',
        2: 'Τρι',
        3: 'Τετ',
        4: 'Πεμ',
        5: 'Παρ',
        6: 'Σαβ'
    },

    # Months
    'months': {
        1: 'Ιανουαρίου',
        2: 'Φεβρουαρίου',
        3: 'Μαρτίου',
        4: 'Απριλίου',
        5: 'Μαΐου',
        6: 'Ιουνίου',
        7: 'Ιουλίου',
        8: 'Αυγούστου',
        9: 'Σεπτεμβρίου',
        10: 'Οκτωβρίου',
        11: 'Νοεμβρίου',
        12: 'Δεκεμβρίου',
    },
    'months_abbrev': {
        1: 'Ιαν',
        2: 'Φεβ',
        3: 'Μαρ',
        4: 'Απρ',
        5: 'Μαϊ',
        6: 'Ιον',
        7: 'Ιολ',
        8: 'Αυγ',
        9: 'Σεπ',
        10: 'Οκτ',
        11: 'Νοε',
        12: 'Δεκ',
    },

    # Units of time
    'year': ['1 χρόνος', '{count} χρόνια'],
    'month': ['1 μήνας', '{count} μήνες'],
    'week': ['1 εβδομάδα', '{count} εβδομάδες'],
    'day': ['1 μέρα', '{count} μέρες'],
    'hour': ['1 ώρα', '{count} ώρες'],
    'minute': ['1 λεπτό', '{count} λεπτά'],
    'second': ['1 δευτερόλεπτο', '{count} δευτερόλεπτα'],

    # Relative time
    'ago': 'πρίν απο {time}',
    'from_now': 'σε {time} απο τώρα',
    'after': '{time} μετά',
    'before': '{time} πρίν'
}

